r-oung/stm32f4-firmware/prj/uwb-positioning/src/main.c
/**
 * @file    main.c
 * @author  Raymond Oung
 * @date    2014.08.11
 * @brief   Main program
 *
 * MIT License
 *
 * Copyright (c) 2022 Raymond Oung
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

/* Includes ------------------------------------------------------------------*/
#include <math.h>
#include <stdio.h>
#include <string.h>

#include "stm32f4xx.h"

#include "can.h"
#include "clock.h"
#include "dip.h"
#include "i2c.h"
#include "led.h"
#include "main.h"
#include "nvic_list.h"
#include "spi.h"
#include "tim.h"
#include "uart.h"

#include "deca_regs.h"
#include "dw1000.h"
#include "m24aa02uid.h"
#include "mpu9150.h"
#include "range.h"
#include "tinysync.h"
#include "trilateration.h"

/** @addtogroup Main
 * @{
 */

/* Private defines
 * ------------------------------------------------------------*/
// #define RANGING_DEMO

#ifdef _LNS_V03
#define VERBOSE_UART_ID 4u // LNS-v03
#else
#define VERBOSE_UART_ID 2u // DWM1000-v02
#endif
#define START_BYTE '@'
#define F_CUTOFF 20.0f // [Hz]

/* Private types -------------------------------------------------------------*/
typedef enum _node_t { NODE_STATIC = 0u, NODE_MOBILE = 1u } node_t;

typedef struct _UWB_static_node_info_t {
  uint32_t uid;   // static node unique identifier
  uint16_t range; // range [m x1000]
  uint8_t snr;    // signal to noise ratio [dBm x10] (0-25)
  uint8_t pwr_fp; // first pass signal power [dBm] (0-200)
  uint8_t pwr_rx; // receiver signal power [dBm] (0-200)
} __attribute__((__packed__)) UWB_static_node_info_t;

typedef struct _UWB_telemetry_msg_t {
  uint8_t start;              // start byte '@'
  uint32_t timestamp;         // [msec]
  uint8_t id;                 // mobile node ID
  float x;                    // position x [m]
  float y;                    // position y [m]
  float z;                    // position z [m]
  uint8_t num_selected_nodes; // number of static nodes
  UWB_static_node_info_t nodes[16];
  uint16_t chksum; // fletcher checksum
} __attribute__((__packed__)) UWB_telemetry_msg_t;

typedef struct _UWB_node_t {
  uint32_t uid;        // node ID
  node_t type;         // NODE_STATIC or NODE_MOBILE
  uint32_t tkn_dst_id; // destination ID for token (mobile node only)
  uint8_t tkn_holder;  // declare token holder (mobile node only)
  float bias;          // range bias [m]
  float x;             // position x [m]
  float y;             // position y [m]
  float z;             // position z [m]
} UWB_node_t;

/* Private function prototypes -----------------------------------------------*/
float UTIL_LPF1(float y, float x, float alpha);
float UTIL_LPF1_GetAlpha(float f_cutoff, float f_sample);
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);

// append 16-bit fletcher checksum to the end of data
void UTIL_SetFletcher16(uint8_t *data, uint16_t size) {
  uint16_t sum1 = 0u;
  uint16_t sum2 = 0u;

  uint8_t i;
  for (i = 0u; i < (size - 2u); i++) { // excludes checksum bytes
    sum1 = (sum1 + data[i]) % 0xFF;
    sum2 = (sum2 + sum1) % 0xFF;
  }

  data[size - 2u] = 0xFF - ((sum1 + sum2) % 0xFF);
  data[size - 1u] = 0xFF - ((sum1 + data[size - 2u]) % 0xFF);
}

// check 16-bit fletcher checksum at the end of data
uint8_t UTIL_ChkFletcher16(uint8_t *data, uint16_t size) {
  uint16_t sum1 = 0u;
  uint16_t sum2 = 0u;

  uint8_t i;
  for (i = 0u; i < size; i++) {
    sum1 = (sum1 + data[i]) % 0xFF;
    sum2 = (sum2 + sum1) % 0xFF;
  }

  return ((sum2 << 8u) | sum1) == 0u;
}

/**
 * @brief Compute running mean
 * @param[in] mean_prev running mean at t-1
 * @param[in] x new sample to be included in the mean at t
 * @param[in] n total samples thus far at t
 * @retval Running mean.
 */
float UTIL_GetMean(float mean, float x, uint32_t n) {
  return mean + (x - mean) / n;
}

/**
 * @brief Compute running average
 * @param y old and new filtered data
 * @param x new sample to be filtered
 * @param alpha smoothing factor, i.e. (sample_time)/(RC + sample_time)
 * @retval 1st Order Low-Pass filtered result.
 */
float UTIL_LPF1(float y, float x, float alpha) { return y + alpha * (x - y); }

/**
 * @brief Compute alpha smoothing factor, i.e. (sample_time)/(RC + sample_time)
 * @param f_cutoff cut-off frequency [Hz]
 * @param f_sample sampling frequency [Hz]
 * @retval 1st Order Low-Pass smoothing factor, alpha.
 */
float UTIL_LPF1_GetAlpha(float f_cutoff, float f_sample) {
  float t_sample = 1.0f / f_sample;               // [sec]
  float rc = (float)(1.0f / (M_2_PI * f_cutoff)); // [rad/s]
  return t_sample / (rc + t_sample);
}

void UTIL_Output2Console(uint8_t num_selected_nodes, uint8_t num_total_nodes,
                         UWB_node_t *static_nodes, float *range) {
  uint8_t i;

  // if (!isnan(TRILAT_GetX() && !isnan(TRILAT_GetY()) && !isnan(TRILAT_GetZ())
  // && 	TRILAT_GetX() > 0.0f && TRILAT_GetY() > 0.0f))
  {
    static uint32_t t0 = 0u;
    if (GetTime() - t0 > 1000.0f / F_CUTOFF) {
      t0 = GetTime();

      char str[100];
      sprintf(str, "%u ", (unsigned int)GetTime());
      UART_Print(VERBOSE_UART_ID, str);
      // sprintf(str,"%.3f %.3f %.3f ", TRILAT_GetX(), TRILAT_GetY(),
      // TRILAT_GetZ()); UART_Print(VERBOSE_UART_ID,str);
      sprintf(str, "%.3f %.3f %.3f ", TRILAT_GetX(), TRILAT_GetY(), 0.0f);
      UART_Print(VERBOSE_UART_ID, str);
      for (i = 0; i < num_total_nodes; i++) {
        sprintf(str, "%.3f ", range[i]);
        UART_Print(VERBOSE_UART_ID, str); // FILTERED RANGE
      }

      for (i = 0; i < num_total_nodes; i++) {
        sprintf(str, "%u ",
                (uint8_t)roundf(10 * NODE_GetSNR(static_nodes[i].uid)));
        UART_Print(VERBOSE_UART_ID, str); // SNR
      }

      for (i = 0; i < num_total_nodes; i++) {
        sprintf(str, "%u ",
                (uint8_t)roundf(-NODE_GetPwrFP(static_nodes[i].uid)));
        UART_Print(VERBOSE_UART_ID, str); // Power FP
      }

      for (i = 0; i < num_total_nodes; i++) {
        sprintf(str, "%u ",
                (uint8_t)roundf(-NODE_GetPwrRX(static_nodes[i].uid)));
        UART_Print(VERBOSE_UART_ID, str); // Power RX
      }

      sprintf(str, "%u ", num_selected_nodes);
      UART_Print(VERBOSE_UART_ID, str); // number of static nodes

      UART_Print(VERBOSE_UART_ID, "\r\n");
    }
  }
}

void UTIL_OutputTelemetry(uint8_t num_selected_nodes, UWB_node_t mobile_node,
                          UWB_node_t *static_nodes, float *range) {
  uint8_t i;
  UWB_telemetry_msg_t msg;

  if (!isnan(TRILAT_GetX()) && !isnan(TRILAT_GetY()) && !isnan(TRILAT_GetZ()) &&
      TRILAT_GetX() > 0.0f && TRILAT_GetY() > 0.0f) {
    static uint32_t t0_telemetry = 0u;
    if (GetTime() - t0_telemetry > 1000.0f / F_CUTOFF) {
      t0_telemetry = GetTime();

      msg.start = START_BYTE;
      msg.timestamp = GetTime();                   // [msec]
      msg.id = mobile_node.uid;                    // mobile node ID
      msg.x = TRILAT_GetX();                       // position x [m]
      msg.y = TRILAT_GetY();                       // position y [m]
      msg.z = 1.5f;                                // position z [m]
      msg.num_selected_nodes = num_selected_nodes; // number of static nodes
      for (i = 0; i < num_selected_nodes; i++) {
        msg.nodes[i].uid = static_nodes[i].uid; // static node unique identifier
        msg.nodes[i].range = range[i];          // range [m x1000]
        msg.nodes[i].snr = (uint8_t)roundf(
            10 * NODE_GetSNR(
                     static_nodes[i].uid)); // signal to noise ratio [dBm x10]
        msg.nodes[i].pwr_fp = (uint8_t)roundf(-NODE_GetPwrFP(
            static_nodes[i].uid)); // first pass signal power [dBm]
        msg.nodes[i].pwr_rx = (uint8_t)roundf(
            -NODE_GetPwrRX(static_nodes[i].uid)); // receiver signal power [dBm]
      }
      UTIL_SetFletcher16((uint8_t *)&msg,
                         sizeof(UWB_telemetry_msg_t)); // checksum
      UART_Write_DMA(VERBOSE_UART_ID, &msg, sizeof(msg));
    }
  }
}

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void) {
  //========================================================================
  // DECLARE STATIC NODES
  //========================================================================
#if 0 // TABLE DEMO
	UWB_node_t node00;
	node00.uid = 0x00;
	node00.type = NODE_STATIC;
	node00.x = 0.0f;
	node00.y = 0.0f;
	node00.z = 0.0f;

	UWB_node_t node01;
	node01.uid = 0x01;
	node01.type = NODE_STATIC;
	node01.x = 0.8f;
	node01.y = 0.0f;
	node01.z = 0.00f;

	UWB_node_t node02;
	node02.uid = 0x02;
	node02.type = NODE_STATIC;
	node02.x = 3.10f;
	node02.y = 0.85f;
	node02.z = 0.0f;

