r-oung/stm32f4-firmware/prj/uwb-positioning/src/main.c
	UWB_node_t node03;
	node03.uid = 0x03;
	node03.type = NODE_STATIC;
	node03.x = 0.0f;
	node03.y = 0.85f;
	node03.z = 0.0f;

	UWB_node_t node04;
	node04.uid = 0x04;
	node04.type = NODE_STATIC;
	node04.x = 0.0f;
	node04.y = 0.0f;
	node04.z = 0.0f;

	UWB_node_t node05;
	node05.uid = 0x05;
	node05.type = NODE_STATIC;
	node05.x = 0.8f;
	node05.y = 0.0f;
	node05.z = 0.0f;

	UWB_node_t node06;
	node06.uid = 0x06;
	node06.type = NODE_STATIC;
	node06.x = 0.8f;
	node06.y = 0.8f;
	node06.z = 0.0f;

	UWB_node_t node07;
	node07.uid = 0x07;
	node07.type = NODE_STATIC;
	node07.x = 0.0f;
	node07.y = 0.8f;
	node07.z = 0.0f;

	UWB_node_t node08;
	node08.uid = 0x08;
	node08.type = NODE_STATIC;
	node08.x = 3.10f;
	node08.y = 0.0f;
	node08.z = 0.0f;

	UWB_node_t node09;
	node09.uid = 0x09;
	node09.type = NODE_STATIC;
	node09.x = 0.8f;
	node09.y = 0.0f;
	node09.z = 0.0f;

	UWB_node_t node0A;
	node0A.uid = 0x0A;
	node0A.type = NODE_STATIC;
	node0A.x = 0.8f;
	node0A.y = 0.8f;
	node0A.z = 0.0f;

	UWB_node_t node0B;
	node0B.uid = 0x0B;
	node0B.type = NODE_STATIC;
	node0B.x = 0.0f;
	node0B.y = 0.8f;
	node0B.z = 0.0f;
#else // YOTSUYA OFFICE DEMO
  UWB_node_t node00; // M0
  node00.uid = 0x00;
  node00.type = NODE_STATIC;
  node00.bias = 154.223624750499f;
  node00.x = 0.71f;
  node00.y = 0.75f;
  node00.z = 2.498f;

  UWB_node_t node01; // M1
  node01.uid = 0x01;
  node01.type = NODE_STATIC;
  node01.bias = 154.242572614108f;
  node01.x = 5.47f;
  node01.y = 0.59f;
  node01.z = 2.499f;

  UWB_node_t node02; // M2
  node02.uid = 0x02;
  node02.type = NODE_STATIC;
  node02.bias = 154.258135779817f;
  node02.x = 5.50f;
  node02.y = 3.50f;
  node02.z = 2.500f;

  UWB_node_t node03; // M3
  node03.uid = 0x03;
  node03.type = NODE_STATIC;
  node03.bias = 154.260341904762f;
  node03.x = 0.62f;
  node03.y = 3.47f;
  node03.z = 2.501f;

  UWB_node_t node04; // M4
  node04.uid = 0x04;
  node04.type = NODE_STATIC;
  node04.bias = 154.261841426404f; // slow changing bias
  node04.x = 2.20f;
  node04.y = 1.96f;
  node04.z = 2.502f;

  UWB_node_t node05; // M5
  node05.uid = 0x05;
  node05.type = NODE_STATIC;
  node05.bias = 154.237874303506f;
  node05.x = 4.15f;
  node05.y = 1.96f;
  node05.z = 2.503f;

  UWB_node_t node06; // P0
  node06.uid = 0x06;
  node06.type = NODE_STATIC;
  node06.bias = 154.263274015748f;
  node06.x = 3.68f;
  node06.y = 6.85f;
  node06.z = 2.20f;

  UWB_node_t node07; // P1
  node07.uid = 0x07;
  node07.type = NODE_STATIC;
  node07.bias =
      154.270061452514; // bias takes a long time to reach steady state
  node07.x = 3.82f;
  node07.y = 5.54f;
  node07.z = 2.50f;

  UWB_node_t node08; // P2
  node08.uid = 0x08;
  node08.type = NODE_STATIC;
  node08.bias = 154.200980021031f;
  node08.x = 1.97f;
  node08.y = 4.21f;
  node08.z = 2.50f;

  UWB_node_t node09; // P3
  node09.uid = 0x09;
  node09.type = NODE_STATIC;
  node09.bias = 154.2;
  node09.x = 0.82f;
  node09.y = 7.07f;
  node09.z = 2.20f;

  UWB_node_t node0A; // P3
  node0A.uid = 0x0A;
  node0A.type = NODE_STATIC;
  node0A.bias = 154.2;
  node0A.x = 0.0f;
  node0A.y = 0.0f;
  node0A.z = 0.0f;
#endif

  //========================================================================
  // DECLARE MOBILE NODES
  //========================================================================
  UWB_node_t nodeF0;
  nodeF0.uid = 0xF0;
  nodeF0.type = NODE_MOBILE;
  nodeF0.tkn_dst_id = nodeF0.uid;
  nodeF0.tkn_holder = 1u;

  UWB_node_t nodeF1;
  nodeF1.uid = 0xF1;
  nodeF1.type = NODE_MOBILE;
  nodeF1.tkn_dst_id = nodeF1.uid;
  nodeF1.tkn_holder = 0u;

  // define static nodes to be used
#ifdef RANGING_DEMO // ranging demo
  UWB_node_t all_nodes[] = {node00, node01, node02, node03, node04,
                            node05, node06, node07, node08, node09,
                            node0A, nodeF0, nodeF1};
  UWB_node_t static_nodes[] = {node00, node01, node02, node03, node04, node05,
                               node06, node07, node08, node09, node0A};
#else // positioning demo
  UWB_node_t all_nodes[] = {node00, node01, node02, node03, node04, node05,
                            node06, node07, node08, node09, nodeF0, nodeF1};
  UWB_node_t static_nodes[] = {node00, node01, node02, node03, node04,
                               node05, node06, node07, node08, node09};
#endif
  uint8_t NUM_ALL_NODES = sizeof(all_nodes) / sizeof(UWB_node_t);
  uint8_t NUM_STATIC_NODES = sizeof(static_nodes) / sizeof(UWB_node_t);

  // configure low-pass filter
  float lpf_alpha = UTIL_LPF1_GetAlpha(
      F_CUTOFF, 1000.0f / NUM_STATIC_NODES); // use alpha=0 to remove filter
  float f_range[TRILAT_MAX_STATIC_NODES];
  uint8_t i;
  for (i = 0u; i < TRILAT_MAX_STATIC_NODES; i++) {
    f_range[i] = 0.0f; // reset filtered range values
  }

  //========================================================================
  // PERIPHERAL INITIALIZATION
  //========================================================================
  RCC_Configuration();
  GPIO_Configuration();
  NVIC_Configuration();

  CLOCK_Init();
  LED_Init(LED1_CLK, LED1_PORT, LED1_PIN);
  LED_OnAll();
  Delay(500);
  LED_OffAll();

#ifdef _LNS_V03
  DIP_Init(ADDR0_CLK, ADDR0_PORT, ADDR0_PIN);
  DIP_Init(ADDR1_CLK, ADDR1_PORT, ADDR1_PIN);
  DIP_Init(ADDR2_CLK, ADDR2_PORT, ADDR2_PIN);

  UART_PeriphInit(UART4, UART4_BAUD, UART4_DMA_BUF_SIZE, UART4_TX_CLK,
                  UART4_TX_PORT, UART4_TX_PIN, UART4_TX_PIN_SRC, UART4_RX_CLK,
                  UART4_RX_PORT, UART4_RX_PIN, UART4_RX_PIN_SRC,
                  UART4_DMA_RX_NVIC_PREEMPTION_PRIORITY,
                  UART4_DMA_TX_NVIC_PREEMPTION_PRIORITY,
                  UART4_IT_RX_NVIC_PREEMPTION_PRIORITY,
                  UART4_IT_TX_NVIC_PREEMPTION_PRIORITY);

  SPI_PeriphInit(SPI1, SPI_BAUD_SLOW, SPI_CPOL0, SPI_CPHA0, SPI1_MOSI_CLK,
                 SPI1_MOSI_PORT, SPI1_MOSI_PIN, SPI1_MOSI_PIN_SRC,
                 SPI1_MISO_CLK, SPI1_MISO_PORT, SPI1_MISO_PIN,
                 SPI1_MISO_PIN_SRC, SPI1_SCLK_CLK, SPI1_SCLK_PORT,
                 SPI1_SCLK_PIN, SPI1_SCLK_PIN_SRC);

  CAN_PeriphInit(CAN1, CAN1_FILT_NUM, CAN1_GPIO_CLK, CAN1_CLK, CAN1_TX_PORT,
                 CAN1_TX_PIN, CAN1_TX_PIN_SOURCE, CAN1_RX_PORT, CAN1_RX_PIN,
                 CAN1_RX_PIN_SOURCE, CAN1_RX_IRQn,
                 CAN1_RX_NVIC_PREEMPTION_PRIORITY, CAN1_TX_IRQn,
                 CAN1_TX_NVIC_PREEMPTION_PRIORITY);

  DW1000_Init(DW1000_SPI, DW1000_EN_CLK, DW1000_EN_PORT, DW1000_EN_PIN,
              DW1000_CS_CLK, DW1000_CS_PORT, DW1000_CS_PIN, DW1000_WAKE_CLK,
              DW1000_WAKE_PORT, DW1000_WAKE_PIN, DW1000_NRST_CLK,
              DW1000_NRST_PORT, DW1000_NRST_PIN, DW1000_IRQ_CLK,
              DW1000_IRQ_PORT, DW1000_IRQ_PIN, DW1000_IRQ_PORT_SRC,
              DW1000_IRQ_PIN_SRC, DW1000_IRQ_LINE, DW1000_IRQ_IRQ,
              DW1000_IRQ_NVIC_PREEMPTION_PRIORITY);

#else
  UART_PeriphInit(UART2, UART2_BAUD, UART2_DMA_BUF_SIZE, UART2_TX_CLK,
                  UART2_TX_PORT, UART2_TX_PIN, UART2_TX_PIN_SRC, UART2_RX_CLK,
                  UART2_RX_PORT, UART2_RX_PIN, UART2_RX_PIN_SRC,
                  UART2_DMA_RX_NVIC_PREEMPTION_PRIORITY,
                  UART2_DMA_TX_NVIC_PREEMPTION_PRIORITY,
                  UART2_IT_RX_NVIC_PREEMPTION_PRIORITY,
                  UART2_IT_TX_NVIC_PREEMPTION_PRIORITY);

