r-oung/stm32f4-firmware/prj/uwb-positioning/src/main.c
  SPI_PeriphInit(SPI2, SPI_BAUD_SLOW, SPI_CPOL0, SPI_CPHA0, SPI2_MOSI_CLK,
                 SPI2_MOSI_PORT, SPI2_MOSI_PIN, SPI2_MOSI_PIN_SRC,
                 SPI2_MISO_CLK, SPI2_MISO_PORT, SPI2_MISO_PIN,
                 SPI2_MISO_PIN_SRC, SPI2_SCLK_CLK, SPI2_SCLK_PORT,
                 SPI2_SCLK_PIN, SPI2_SCLK_PIN_SRC);

  DW1000_Init(DW1000_SPI, DW1000_EN_CLK, DW1000_EN_PORT, DW1000_EN_PIN,
              DW1000_CS_CLK, DW1000_CS_PORT, DW1000_CS_PIN, DW1000_WAKE_CLK,
              DW1000_WAKE_PORT, DW1000_WAKE_PIN, DW1000_NRST_CLK,
              DW1000_NRST_PORT, DW1000_NRST_PIN, DW1000_IRQ_CLK,
              DW1000_IRQ_PORT, DW1000_IRQ_PIN, DW1000_IRQ_PORT_SRC,
              DW1000_IRQ_PIN_SRC, DW1000_IRQ_LINE, DW1000_IRQ_IRQ,
              DW1000_IRQ_NVIC_PREEMPTION_PRIORITY);

  I2C_PeriphInit(I2C1, I2C1_SPEED, I2C1_SDA_CLK, I2C1_SDA_PORT, I2C1_SDA_PIN,
                 I2C1_SDA_PIN_SOURCE, I2C1_SCL_CLK, I2C1_SCL_PORT, I2C1_SCL_PIN,
                 I2C1_SCL_PIN_SOURCE, I2C1_NVIC_PREEMPTION_PRIORITY);

  M24AA02UID_Init(M24AA02UID_I2C);

  MPU9150_Init(MPU9150_I2C, MPU9150_BANDWIDTH_98, MPU9150_GYRO_RANGE_250,
               MPU9150_ACCL_RANGE_2);

#if 0
	char out[100]; sprintf(out,"UID: %u\r\n", (unsigned int)M24AA02UID_GetUID()); UART_Print(VERBOSE_UART_ID,out);

	NAV_Init();
	NAV_CalibrateStatic(1000);

	// while(1)
	// {
	// 	LED_Blink(0,100);
	// 	Delay(10);

	// 	MPU9150_ReadSensor();
	// 	AK8975_ReadSensor();

	// 	char str[100]; 
	// 	sprintf(str, "%.3f %.3f %.3f %.3f %.3f %.3f %.3f %.3f %.3f %.3f\r\n", 
	// 		GetTimeU(),
	// 		MPU9150_GetGyroX(), MPU9150_GetGyroY(), MPU9150_GetGyroZ(),
	// 		MPU9150_GetAcclX(), MPU9150_GetAcclY(), MPU9150_GetAcclZ(),
	// 		MPU9150_GetMagnX(), MPU9150_GetMagnY(), MPU9150_GetMagnZ());
	// 	UART_Print(VERBOSE_UART_ID,str);
	
	// 	NAV_SensGyro(MPU9150_GetGyroX(), MPU9150_GetGyroY(), MPU9150_GetGyroZ());
	// 	NAV_SensAccl(MPU9150_GetAcclX(), MPU9150_GetAcclY(), MPU9150_GetAcclZ());
	// 	NAV_SensMagn(MPU9150_GetMagnX(), MPU9150_GetMagnY(), MPU9150_GetMagnZ());
	
	// }
#endif

#endif

  // DIP_SetVal(node0A.uid);
  DIP_SetVal(nodeF0.uid); // <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
                          // MANUALLY SET NODE ID HERE!!!

  //========================================================================
  // DW1000 UWB CONFIGURATION
  //========================================================================
  // Note:
  // Channel depends on legal authorities; Channel and Data Rate affect distance
  // and bandwidth PRF affects robustess and range, Section 9.3 Preamble code
  // depends on Channel and PRF, Section 10.5 Preamble length depends on Data
  // Rate, Section 9.3

  // @TODO 110K and 850K data rates don't work properly!!!
  // <<<<<<<<<<<<<<<<<<<<<<<<< Japan: Ch-1 to Ch-4 at -41.3 dBm/MHz with DAA/LDC
  // >>DW1000_Config(CH1, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // >>DW1000_Config(CH1, DATA_RATE_850, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_1024); // short range, high node density, high resolution
  // DW1000_Config(CH1, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution
  // DW1000_Config(CH2, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // DW1000_Config(CH2, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution
  // DW1000_Config(CH3, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // DW1000_Config(CH3, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution
  // DW1000_Config(CH4, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_17,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // DW1000_Config(CH4, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_17,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution

  // Europe: Ch-5/-7 at -41.3 dBm/MHz
  // DW1000_Config(CH5, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // DW1000_Config(CH5, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_9,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution
  // DW1000_Config(CH7, DATA_RATE_110, PRF_64MHZ, PREAMBLE_CODE_17,
  // PREAMBLE_LENGTH_4096); // long range, low node density, low resolution
  // DW1000_Config(CH7, DATA_RATE_6800, PRF_64MHZ, PREAMBLE_CODE_17,
  // PREAMBLE_LENGTH_256); // short range, high node density, high resolution

  // DecaWave defaults configuration
  // DW1000_Config(CH5, DATA_RATE_6800, PRF_16MHZ, PREAMBLE_CODE_4,
  // PREAMBLE_LENGTH_128); // short range, high node density, high resolution
  DW1000_ConfigDefault(); // DEBUG @TODO From preliminary tests, this provides
                          // the best resolution in comparison to the mode above
// DW1000_ReadAllRegisters();

// DEBUG
#if 0
	float background_energy = DW1000_ReadBackgroundEnergy(CH5);
	char str[100]; sprintf(str, "Background Energy: %.3f\r\n", background_energy); UART_Print(VERBOSE_UART_ID,str);
	while(1);
#endif

  // initialise node to receiver or transmitter
  // initialise token holder
  volatile uint8_t first2wait;
  static volatile UWB_node_t this_node;
  uint8_t k;
  for (k = 0u; k < NUM_ALL_NODES; k++) {
    // step through each node
    if (all_nodes[k].uid == DIP_GetVal()) {
      this_node = all_nodes[k];
      switch (this_node.type) {
      case NODE_STATIC: {
        DW1000_RxTimeout(DISABLE);
        DW1000_ReceiverOn();
      } break;

      case NODE_MOBILE: {
        DW1000_RxTimeout(ENABLE);

        if (!this_node.tkn_holder) {
          first2wait = 1u;
          RANGE_ClrToken();
        } else {
          first2wait = 0u;
          RANGE_SetToken();
        }
      } break;
      }
    }
  }

  // upon completing initialisation, increase baud-rate
  SPI_SetBaudPrescaler(1u, SPI_BAUD_FAST);

