r-oung/stm32f4-firmware/prj/uwb-positioning/src/main.c
  //========================================================================
  // RANGE INITIALIZATION
  //========================================================================
  RANGE_Init(this_node.uid);
  switch (this_node.type) {
  case NODE_MOBILE: {
    for (i = 0u; i < NUM_STATIC_NODES; i++) {
      RANGE_AddStaticNode(static_nodes[i].uid);
    }
    RANGE_UpdateStaticNodes();
  } break;

  case NODE_STATIC: {
    while (1) {
      Delay(5000);
      LED_On(0);
      Delay(100);
      LED_Off(0);
    }
  } break;
  }

  //========================================================================
  // TRILATERATION INITIALIZATION
  //========================================================================
  if (this_node.type == NODE_MOBILE) {
    for (i = 0u; i < NUM_STATIC_NODES; i++) {
      TRILAT_AddStaticNode(static_nodes[i].x, static_nodes[i].y,
                           static_nodes[i].z);
    }
    TRILAT_UpdateStaticNodes();
  }

//========================================================================
// MAIN LOOP
//========================================================================
// @TODO: Static nodes should come on periodically to check for mobile nodes
// once a mobile node is detected, static node should stay on until timeout,
// i.e. turn off when mobile nodes leave the vicinity
// Mobile nodes should turn on only when transmitting
#define PROBE_TIMEOUT 3u // [msec]
#define TOKEN_TIMEOUT                                                          \
  PROBE_TIMEOUT *NUM_STATIC_NODES +                                            \
      1u // must be larger than the time required to send all probes [msec]
  while (1) {
    static uint8_t id = 0u;

    // check that static node-ID is valid
    if (id < NUM_STATIC_NODES) {
#if 0 // send a probe after receiving a response or timing out
			Delay(10);
#else
      uint32_t t1 = GetTime();
      while (!NODE_GetTxReady()) {
        if (GetTime() - t1 > PROBE_TIMEOUT) {
          break;
        }
      }
#endif

      // send ranging probe and adjust token destination ID
      if (id == NUM_STATIC_NODES - 1u) {
        // if this is the last static node in the set, send the token
        // destination identifier
        RANGE_SendProbe(static_nodes[id].uid, this_node.tkn_dst_id);
      } else {
        // if this is not the last static node in the set, don't send the token
        // destination identifier
        RANGE_SendProbe(static_nodes[id].uid, this_node.uid);
      }

      // run watchdog ISR
      NODE_WatchdogISR(static_nodes[id].uid);

      // increment id
      id++;
    } else // after probing all nodes, run trilateration, etc.
    {
#ifdef RANGING_DEMO // ranging demo

      if (GetTime() > 15000u) // wait for warmup
      {
        static uint8_t first = 1u;
        static float t0_bias = 0.0f; // [msec]
        static uint32_t cnt[16u];

        // estimate bias error
        if (first) {
          first = 0u;
          for (i = 0u; i < NUM_STATIC_NODES; i++) {
            static_nodes[i].bias = 0.0f; // clear bias
            f_range[i] = 1.0f;           // set initial condition [m]
            cnt[i] = 1u;
          }
          lpf_alpha = UTIL_LPF1_GetAlpha(20.0f, 1000.0f / NUM_STATIC_NODES);

          t0_bias = GetTime(); // [msec]
        }

        if (GetTime() - t0_bias < 1000u) {
          for (i = 0u; i < NUM_STATIC_NODES; i++) {
            float val = NODE_GetRange(static_nodes[i].uid) - 154.0f;
            if (fabs(val) < 10.0f) {
              static_nodes[i].bias =
                  UTIL_GetMean(static_nodes[i].bias,
                               NODE_GetRange(static_nodes[i].uid), cnt[i]++);
              // char str[100]; sprintf(str, "%u: val: %.3f, bias: %.3f, range:
              // %.3f, cnt: %u\r\n", i, val, static_nodes[10].bias,
              // NODE_GetRange(static_nodes[10].uid), cnt[10]);
              // UART_Print(VERBOSE_UART_ID,str);
            }
          }
        } else {
          LED_On(0);
          for (i = 0u; i < NUM_STATIC_NODES; i++) {
            float val = NODE_GetRange(static_nodes[i].uid) -
                        static_nodes[i].bias + 1.0f; // [m]
            if (val > 0.0f && val < 10.0f) {
              f_range[i] = UTIL_LPF1(f_range[i], val, lpf_alpha); // filtered
            }
          }
          char str[100];
          sprintf(str, "%.1f cm            \r", 100.0f * f_range[10]);
          UART_Print(VERBOSE_UART_ID, str);
        }
      } else {
        if (GetTime() > 14000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing...done\r");
        } else if (GetTime() > 13000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing...    \r");
        } else if (GetTime() > 12000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing..     \r");
        } else if (GetTime() > 11000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing.      \r");
        } else if (GetTime() > 10000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing       \r");
        } else if (GetTime() > 9000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing...    \r");
        } else if (GetTime() > 8000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing..     \r");
        } else if (GetTime() > 7000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing.      \r");
        } else if (GetTime() > 6000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing       \r");
        } else if (GetTime() > 5000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing...    \r");
        } else if (GetTime() > 4000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing..     \r");
        } else if (GetTime() > 3000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing.      \r");
        } else if (GetTime() > 2000u) {
          UART_Print(VERBOSE_UART_ID, "Initializing       \r");
        }
      }

