r-oung/stm32f4-firmware/prj/uwb-positioning/src/main.c
#else // localisation demo

      // run trilateration when range to a sufficient number of static nodes is
      // known
      uint8_t num_selected_nodes = 0u;
      float s_range[NUM_STATIC_NODES]; // selected valid range values
      for (i = 0u; i < NUM_STATIC_NODES; i++) {
        s_range[i] = 0.0f; // clear buffer

        // float val = NODE_GetRange(static_nodes[i].uid); // [m] USE WHEN
        // CALIBRATING
        float val =
            NODE_GetRange(static_nodes[i].uid) - static_nodes[i].bias; // [m]
        if (val > 0.0f && val < 10.0f) // @TODO sometimes range is unusually
                                       // large, so filter it out
        {
          f_range[i] = UTIL_LPF1(f_range[i], val, lpf_alpha); // filtered
          s_range[num_selected_nodes++] = f_range[i];
          TRILAT_AddStaticNode(static_nodes[i].x, static_nodes[i].y,
                               static_nodes[i].z);
        }
      }

// YOTSUYA OFFICE ROOM FILTER
#define YOTSUYA_CONFERENCE_ROOM_THRESHOLD_X 6.60f
#define YOTSUYA_CONFERENCE_ROOM_THRESHOLD_Y 4.05f
#define YOTSUYA_PRESIDENT_OFFICE_THRESHOLD_X 5.60f
#define YOTSUYA_PRESIDENT_OFFICE_THRESHOLD_Y 7.85f
#define YOTSUYA_NODE_THRESHOLD 6u
      if (TRILAT_UpdateStaticNodes() == 1u) {
        TRILAT_UpdateMobileNode(s_range);

        if (!isnan(TRILAT_GetX()) && !isnan(TRILAT_GetY()) &&
            !isnan(TRILAT_GetZ()) && TRILAT_GetX() > 0.0f &&
            TRILAT_GetX() < YOTSUYA_CONFERENCE_ROOM_THRESHOLD_X &&
            TRILAT_GetY() > 0.0f &&
            TRILAT_GetY() < YOTSUYA_CONFERENCE_ROOM_THRESHOLD_Y) {
          LED_On(0);

          // run trilateration when range to a sufficient number of static nodes
          // is known
          uint8_t num_selected_nodes = 0u;
          float s_range[NUM_STATIC_NODES]; // selected valid range values
          for (i = 0u; i < NUM_STATIC_NODES; i++) {
            s_range[i] = 0.0f; // clear buffer

            // now trilaterate only on selected nodes
            if (static_nodes[i].uid < YOTSUYA_NODE_THRESHOLD) {
              // float val = NODE_GetRange(static_nodes[i].uid); // [m] USE WHEN
              // CALIBRATING
              float val = NODE_GetRange(static_nodes[i].uid) -
                          static_nodes[i].bias; // [m]
              if (val > 0.0f && val < 8.0f)     // @TODO sometimes range is
                                            // unusually large, so filter it out
              {
                f_range[i] = UTIL_LPF1(f_range[i], val, lpf_alpha); // filtered
                s_range[num_selected_nodes++] = f_range[i];
                TRILAT_AddStaticNode(static_nodes[i].x, static_nodes[i].y,
                                     static_nodes[i].z);
              }
            }
          }

          if (TRILAT_UpdateStaticNodes() == 1u) {
            TRILAT_UpdateMobileNode(s_range);
            UTIL_OutputTelemetry(num_selected_nodes, this_node, static_nodes,
                                 s_range);
            // UTIL_Output2Console(num_selected_nodes, NUM_STATIC_NODES,
            // static_nodes, s_range);
          }
        } else if (!isnan(TRILAT_GetX()) && !isnan(TRILAT_GetY()) &&
                   !isnan(TRILAT_GetZ()) && TRILAT_GetX() > 0.0f &&
                   TRILAT_GetX() < YOTSUYA_PRESIDENT_OFFICE_THRESHOLD_X &&
                   TRILAT_GetY() > YOTSUYA_CONFERENCE_ROOM_THRESHOLD_Y &&
                   TRILAT_GetY() < YOTSUYA_PRESIDENT_OFFICE_THRESHOLD_Y) {
          LED_On(0);

          // run trilateration when range to a sufficient number of static nodes
          // is known
          uint8_t num_selected_nodes = 0u;
          float s_range[NUM_STATIC_NODES]; // selected valid range values
          for (i = 0u; i < NUM_STATIC_NODES; i++) {
            s_range[i] = 0.0f; // clear buffer

            // now trilaterate only on selected nodes
            if (static_nodes[i].uid >= YOTSUYA_NODE_THRESHOLD ||
                static_nodes[i].uid == 3u) {
              // float val = NODE_GetRange(static_nodes[i].uid); // [m] USE WHEN
              // CALIBRATING
              float val = NODE_GetRange(static_nodes[i].uid) -
                          static_nodes[i].bias; // [m]
              if (val > 0.0f && val < 8.0f)     // @TODO sometimes range is
                                            // unusually large, so filter it out
              {
                f_range[i] = UTIL_LPF1(f_range[i], val, lpf_alpha); // filtered
                s_range[num_selected_nodes++] = f_range[i];
                TRILAT_AddStaticNode(static_nodes[i].x, static_nodes[i].y,
                                     static_nodes[i].z);
              }
            }
          }

          if (TRILAT_UpdateStaticNodes() == 1u) {
            TRILAT_UpdateMobileNode(s_range);
            UTIL_OutputTelemetry(num_selected_nodes, this_node, static_nodes,
                                 s_range);
            // UTIL_Output2Console(num_selected_nodes, NUM_STATIC_NODES,
            // static_nodes, s_range);
          }
        } else {
          LED_Off(0);
          // UTIL_Output2Console(num_selected_nodes, NUM_STATIC_NODES,
          // static_nodes, s_range);
        }
      }

      //----------------------------------------------------------------------------------------------------------
      // DEBUG
      //----------------------------------------------------------------------------------------------------------
      // UTIL_OutputTelemetry(num_selected_nodes, this_node, static_nodes,
      // s_range); // debug UTIL_Output2Console(num_selected_nodes,
      // NUM_STATIC_NODES, static_nodes, f_range);

      //----------------------------------------------------------------------------------------------------------
      // MULTIPLE MOBILE NODES: WAIT FOR TOKEN
      //----------------------------------------------------------------------------------------------------------
      if (this_node.uid != this_node.tkn_dst_id) {
        // turn transceiver off and listen for token
        // DW1000_TransceiverOff();
        DW1000_RxTimeout(DISABLE);
        DW1000_ReceiverOn();

        if (first2wait) // this is only used when turning on the nodes for the
                        // first time
        {
          first2wait = 0u;

          // wait until we get the token
          while (!RANGE_GetToken())
            ;
        } else {
          // wait until we get the token or until timeout
          uint32_t to = GetTime();
          while (!RANGE_GetToken()) {
            if (GetTime() - to > TOKEN_TIMEOUT) {
              break;
            }
          }
        }
        DW1000_RxTimeout(ENABLE);
      }

#endif

